#ifndef timerMinim_h
#define timerMinim_h

#include <Arduino.h>

/*
	Таймер для переодически повторяющихся операций.

	Отсчёт каждого цикла начинается с момента опроса готовности таймера, если он к этому времени сработал.
	Это приводит к тому, что периоды не равномерны, время каждого цикла не может быть меньше заданного,
	но может быть намного больше заданного. Таким образом таймер не отсчитывает равные промежутки,
	а скорее гарантирует пропуск заданного времени для приписанной к таймеру операции.

	В фоне ничего не считается, ресурсов не потребляет, все расчёты только в момент вызова isReady()

	Для разовых ожиданий проще использовать millis() напрямую.
*/

class timerMinim
{
	public:
		// объявление таймера с указанием интервала
		timerMinim(uint32_t interval=60000) {
			setInterval(interval);
		}
		// установка интервала работы таймера и сброс таймера
		void setInterval(uint32_t interval) {
			// хотя-бы одна миллисекунда, для приличия
			_interval = interval ? interval: 1;
			reset();
		}
		// возвращает true, когда пришло время.
		bool isReady() {
			uint32_t now = millis();
			if ((uint32_t)(now - _start) >= _interval) {
				reset();
				return true;
			}
			return false;
		}
		// ручной сброс таймера на установленный интервал
		void reset() {
			_start = millis();
		}
		// выставить задержку до следующего срабатывания
		void setNext(uint32_t next = 0) {
			_start = millis() - (_interval - next);
		}

	private:
		uint32_t _interval = 0;
		uint32_t _start = 0;
};

#endif